{
  "topics": [
    {
      "topic": "Least Squares Problems and the Pseudo-Inverse",
      "sub_topics": [
        "The least squares method addresses overdetermined systems of linear equations, represented as Ax = b, where A is an m × n matrix with m > n, indicating more equations than unknowns. The goal is to find solutions x that minimize ||Ax - b||², the square of the Euclidean norm. Solutions to the least squares problem Ax = b are given by the normal equations ATAx = ATb, derived by minimizing the Euclidean norm ||Ax - b||², where ||u||² = u₁² + ... + un² for a vector u = (u₁, ..., un). When the columns of A are linearly independent, the matrix ATA is invertible, leading to a unique least squares solution x = (ATA)⁻¹ATb. The matrix ATA is symmetric, which simplifies computations.",
        "For any real m × n matrix A, there exists a unique vector x⁺ of minimum norm that minimizes ||Ax - b||², even when the columns of A are linearly dependent. This solution can be interpreted geometrically as the orthogonal projection of b onto the column space of A. This vector x⁺ is referred to as the least squares solution of smallest norm and satisfies Ax⁺ = p, where p is the orthogonal projection of b onto the subspace U = Im A. The vector x⁺ belongs to (Ker A)⊥, the orthogonal complement of the kernel of A, and minimizes ||Ax - b||².",
        "The minimum norm least squares solution x⁺ can be expressed using the pseudo-inverse A⁺ of A, derived from the singular value decomposition (SVD) of A. If A = VDUᵀ is the SVD of A, then A⁺ = UD⁺Vᵀ, where D⁺ is obtained by inverting the nonzero diagonal entries of D and transposing the matrix. The least squares solution of smallest norm for the linear system Ax = b is given by x⁺ = A⁺b = UD⁺Vᵀb. The pseudo-inverse A⁺ provides the optimal solution to the least squares problem and depends only on A.",
        "The pseudo-inverse A⁺ can be computed without explicitly determining the SVD factorization. If A has full rank, A⁺ = (ATA)⁻¹AT when m ≥ n, and A⁺ = AT(AAT)⁻¹ when n ≥ m. A⁺A = I in the first case, and AA⁺ = I in the second case, indicating that A⁺ is a left or right inverse of A, respectively.",
        "The matrix AA⁺ is the orthogonal projection onto the range of A, while A⁺A is the orthogonal projection onto Ker(A)⊥ = Im(AT), where Ker(A) is the kernel of A and Im(AT) is the range of AT. These projections are symmetric and satisfy (AA⁺)² = AA⁺ and (A⁺A)² = A⁺A. The method of least squares is a fundamental tool in mathematical sciences, with extensions such as weighted least squares and recursive least squares. The QR-decomposition, using Householder transformations, can also be applied to solve least squares problems efficiently."
      ]
    },
    {
      "topic": "Properties of the Pseudo-Inverse",
      "sub_topics": [
        "Given any m × n matrix A (real or complex), the pseudo-inverse A⁺ of A is the unique n × m matrix satisfying the four Penrose conditions: AA⁺A = A, A⁺AA⁺ = A⁺, (AA⁺)* = AA⁺, and (A⁺A)* = A⁺A.",
        "When A has full rank, the pseudo-inverse A⁺ can be expressed as A⁺ = (ATA)⁻¹AT when m ≥ n, and as A⁺ = AT(AAT)⁻¹ when n ≥ m. In the first case (m ≥ n), A⁺A = I, so A⁺ is a left inverse of A; in the second case (n ≥ m), we have AA⁺ = I, so A⁺ is a right inverse of A.",
        "For any m × n matrix A, both AA⁺ and A⁺A are symmetric matrices. If A = VSigmauᵀ is the SVD of A, then AA⁺ = V[[Iᵣ, 0], [0, 0]]Vᵀ and A⁺A = U[[Iᵣ, 0], [0, 0]]Uᵀ, where r is the rank of A.",
        "The matrix AA⁺ is the orthogonal projection onto the range of A, and A⁺A is the orthogonal projection onto Ker(A)⊥ = Im(AT), the range of AT. The matrix AA⁺ consists of all vectors y ∈ ℝᵐ such that Vᵀy = [[z], [0]], with z ∈ ℝʳ. The matrix A⁺A consists of all vectors y ∈ ℝⁿ such that Uᵀy = [[z], [0]], with z ∈ ℝʳ.",
        "If A is a normal matrix (i.e., AAT = ATA), there is a close relationship between the SVD of A and its block diagonalization. The pseudo-inverse of a normal matrix can be obtained directly from a block diagonalization of A. For any (real) normal matrix A and any block diagonalization A = UAUᵀ of A, the pseudo-inverse of A is given by A⁺ = UA⁺Uᵀ, where A⁺ is the pseudo-inverse of A. Furthermore, if A = [[Ar, 0], [0, 0]], then A⁺ = [[Ar⁻¹, 0], [0, 0]]."
      ]
    },
    {
      "topic": "Data Compression and SVD",
      "sub_topics": [
        "Given an m × n matrix A of rank r, the best approximation of A by a matrix B of rank k ≤ r, in terms of minimizing ||A - B||₂, is given by Ak = Σᵢ₌₁ᵏ σᵢuᵢvᵢᵀ, where uᵢ and vᵢ are the columns of U and V, respectively, and σᵢ are the singular values of A. The error of this approximation is ||A - Ak||₂ = σₖ₊₁. The matrix Ak can be stored using (m + n)k entries, which is a substantial gain when k < m.",
        "Data compression is one of the many applications of SVD. In order to make precise the notion of closeness of matrices, we use the notion of matrix norm.",
        "Principal Component Analysis (PCA) is used to identify patterns in data and understand the variance-covariance structure of the data. It involves finding uncorrelated projections Y of the data points X₁, ..., Xₙ onto some directions v such that var(Y) is maximal. Given an n × d matrix X of data points X₁, ..., Xₙ, a first principal component of X is a centered point Y₁ = (X - μ)v₁, where μ is the centroid of the Xᵢ's, and v₁ is a unit vector such that var(Y₁) is maximized. More generally, a (k+1)th principal component is a centered point Yₖ₊₁ = (X - μ)vₖ₊₁, where vₖ₊₁ is a unit vector such that var(Yₖ₊₁) is maximized, subject to cov(Yₕ, Yₖ₊₁) = 0 for all h with 1 ≤ h ≤ k.",
        "The principal directions u₁, ..., ud of X - μ (and X) are the columns of U in the SVD decomposition X - μ = VDUᵀ. These directions are mutually orthogonal, and the singular values σ₁, ..., σd are the eigenvalues of the symmetric positive semidefinite matrix (X – μ)ᵀ(X – μ). The SVD of a matrix X yields its principal components; if X - μ = VDUᵀ is an SVD decomposition, where μ is the centroid of the data points, then the columns of VD, denoted as Yk = (X - μ)uk, represent the principal components of X. The variance of the kth principal component Yk is given by σk² / (n - 1), where σk is the kth singular value on the main diagonal of D, and the covariance between different principal components Yh and Yk is zero (cov(Yh, Yk) = 0) for h ≠ k."
      ]
    },
    {
      "topic": "Best Affine Approximation",
      "sub_topics": [
        "Finding the best affine approximation involves approximating a data set of n points X₁, ..., Xₙ in ℝᵈ by a p-dimensional affine subspace A of ℝᵈ, where 1 ≤ p ≤ d - 1. A problem very close to PCA (and based on least squares) is to best approximate a data set of n points (X₁, ..., Xₙ), with Xi ∈ ℝᵈ, by a p-dimensional affine subspace A of (ℝᵈ), with (1 ≤ p ≤ d-1) (the terminology rank d p is also used).",
        "For the case p = d - 1, the affine subspace is a hyperplane A₁ given by an equation a₁x₁ + ··· + aₓd + c = 0, where a = (a₁, ..., aₓ) is a unit vector. The best approximation is found by solving a homogeneous linear system in the least squares sense, subject to the condition that a is a unit vector. This leads to the conclusion that the hyperplane A₁ must pass through the centroid μ of the data points X₁, ..., Xₙ.",
        "The best (d - k)-dimensional affine subspace Ak approximating X₁, ..., Xₙ in the least squares sense is given by Ak = μ + Ud-k, where Ud-k is the linear subspace spanned by the first d – k principal directions of X - μ, i.e., the first d – k columns of U in the SVD decomposition X - μ = VDUᵀ. A best (d-k)-dimensional affine subspace (A_k) approximating (X_1,..., X_n) in the least squares sense is given by (A_k = μ + U_{d-k}), where (U_{d-k}) is the linear subspace spanned by the first d – k columns of U, the first d – k principal directions of (X - μ) ((1 ≤ k ≤ d- 1)).",
        "In general, since an SVD of X is not unique, the principal directions u₁, ..., ud are not unique. This can happen when a data set has some rotational symmetries, and in such a case, PCA is not a very good method for analyzing the data set."
      ]
    },
    {
      "topic": "Principal Components Analysis (PCA)",
      "sub_topics": [
        "Principal Component Analysis (PCA) identifies patterns in data and understands the variance-covariance structure. PCA is useful for data reduction and interpretation. The main idea of PCA is to find uncorrelated projections Y of the data points (X₁, ..., Xₙ) onto some directions v such that var(Y) is maximal.",
        "Given an (n × d) matrix X of data points (X₁, ..., Xₙ), a first principal component of X is a centered point (Y₁ = (X - μ)v₁), the projection of (X₁, ..., Xₙ) onto a direction (v₁) such that var((Y₁)) is maximized, where (v₁) is a unit vector (recall that (Y₁ = (X - μ)v₁) is a linear combination of the (Cⱼ)'s, the columns of (X - μ)).",
        "More generally, if (Y₁, ..., Yₖ) are k principal components of X along some unit vectors (u₁, ..., uₖ), where (1 ≤ k < d), a ((k+1))th principal component of X (((k+1))th PC) is a centered point (Yₖ₊₁ = (X - μ)vₖ₊₁), the projection of (X₁, ..., Xₙ) onto some direction (vₖ₊₁) such that var((Yₖ₊₁)) is maximized, subject to cov((Yₕ, Yₖ₊₁)) = 0 for all h with (1 ≤ h ≤ k), and where (vₖ₊₁) is a unit vector (recall that (Yₕ = (X - μ)vₕ) is a linear combination of the (Cⱼ)'s).",
        "Let X be an (n × d) matrix of data points (X₁, ..., Xₙ), and let (μ) be the centroid of the (Xᵢ)'s. If (X - μ = VDUᵀ) is an SVD decomposition of (X - μ) and if the main diagonal of D consists of the singular values (λ₁ ≥ λ₂ ≥ ... ≥ λd), then the centered points (Y₁, ..., Yd), where (Yₖ = (X - μ)uₖ = kth column of VD) and (uₖ) is the kth column of U, are d principal components of X. Furthermore, (var(Yₖ) = σₖ²/(n-1)) and (cov(Yₕ, Yₖ) = 0), whenever (h ≠ k) and (1 ≤ k, h ≤ d). The d columns (u₁, ..., ud) of U are usually called the principal directions of (X - μ) (and X)."
      ]
    },
    {
      "topic": "Applications of SVD and Pseudo-Inverses",
      "sub_topics": [
        "The pseudo-inverse plays a crucial role in solving linear systems by the method of least squares, especially in overdetermined systems where the matrix A is a rectangular m × n matrix with more equations than unknowns (m > n). The least squares solution minimizes ||Ax - b||², and when the columns of A are linearly independent, the unique solution is x = (ATA)⁻¹ATb. For any real m × n matrix A, there exists a unique x⁺ of minimum norm that minimizes ||Ax - b||², even when the columns of A are linearly dependent. This solution x⁺ can be interpreted geometrically as the orthogonal projection of b onto the column space of A. The minimum norm least squares solution x⁺ can be found using the pseudo-inverse A⁺ of A, which is obtained from the singular value decomposition (SVD) of A.",
        "Given a nonzero m × n matrix A of rank r, its SVD is A = VDUᵀ, where D is a matrix with Λ (an r × r diagonal matrix consisting of the nonzero singular values of A) and zeros elsewhere. The pseudo-inverse A⁺ is defined as A⁺ = UD⁺Vᵀ, where D⁺ is obtained by inverting the nonzero diagonal entries of D and transposing. The pseudo-inverse satisfies properties such as AA⁺A = A, A⁺AA⁺ = A⁺, (AA⁺)ᵀ = AA⁺, and (A⁺A)ᵀ = A⁺A.",
        "When A has full rank, the pseudo-inverse A⁺ can be expressed as (ATA)⁻¹AT when m ≥ n (left inverse) and as Aᵀ(AAT)⁻¹ when n ≥ m (right inverse). AA⁺ is the orthogonal projection onto the range of A, and A⁺A is the orthogonal projection onto Ker(A)⊥, the range of Aᵀ. If A is a normal matrix (AAT = ATA), its pseudo-inverse can be obtained directly from a block diagonalization.",
        "Singular value decomposition (SVD) is useful in data compression. Given an m × n matrix A of rank r, a best approximation B of rank k ≤ r minimizes ||A - B||₂ (or ||A - B||F), where || ||₂ is the spectral norm and || ||F is the Frobenius norm. The Eckart-Young theorem states that the matrix Ak formed by summing the first k singular values of A provides this best approximation. Aₖ can be stored using (m + n)k entries, offering a substantial gain when k is smaller than m and n.",
        "Principal Component Analysis (PCA) identifies patterns in data and understands its variance-covariance structure. Given a data set X = {X₁, ..., Xₙ}, where each Xᵢ ∈ ℝᵈ, PCA translates the origin to the centroid μ of the Xᵢ's. The principal components are uncorrelated projections Y of the data points onto directions v such that var(Y) is maximized. The main theorem states that the SVD of X yields the principal components, where the kth principal component is given by Yₖ = (X - μ)uₖ (kth column of VD), and uₖ is the kth column of U.",
        "QR decomposition using Householder transformations can solve least squares problems for an m × n matrix A of rank n (m ≥ n). The decomposition A = H₁...HᵣR, where Hᵢ are Householder matrices and R is an upper triangular matrix, transforms the least squares problem into an equivalent system Rx = Hᵣ...H₁b. The least squares solution of smallest norm is x⁺ = R₁⁻¹c, where R₁ is an invertible n × n matrix and c ∈ ℝⁿ."
      ]
    }
  ]
}